# Lab 06 - EDA (Exploratory Data Analysis) - Andrew Badzioch

**What is EDA:**
1. EDA is a process in data analysis used to analyze and investigate datasets and find out about the main characteriztics.
2. EDA helps data analysts to discover patterns and check assumptions.
3. EDA is also used to better understand the dataset variables and the relationship between them.
4. EDA can help the management team in answering their questions.
5. EDA was developed by the American mathematician John Tukey in the 1970's.
6. If data visualization tools will be included in the EDA, it can offer a graphic presentation of data.
7. When EDA is completed, the processed data can be used in more sophisticated data analysis and model building process such as Machine Learning  (ML)applications.

**Types of EDA:**
1. Univariate: Creating EDA examining one variable only as the datasest
2. Bivariate: Creating EDA examining two variables as the dataset
3. Multivariate: Creating EDA examining more than two variables as the dataset

**Tools for EDA Presentation:**
1. Graphical (data visualization): plots, charts, graphs, heatmaps, histograms
2. Nongraphical: Examining the relationship between the variables.

**EDA most popular languages:**
1. Python
2. R lang

In [1]:
# import the libraries
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

#### Finishing movies practice
- study for Final Project

In [2]:
# load the dataset
df = pd.read_csv('movies.csv')

In [3]:
# copy the dataset
# make sure the dataset has been copied and check the top 5 rows
movies = df.copy()
movies.head()

   Rank                         Title       Studio       Gross  Year
0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
1     2                        Avatar          Fox  $2,789.70   2009
2     3                       Titanic    Paramount  $2,187.50   1997
3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018

In [4]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    782 non-null    int64
 1   Title   782 non-null    object
 2   Studio  782 non-null    object
 3   Gross   782 non-null    object
 4   Year    782 non-null    int64
dtypes: int64(2), object(3)
memory usage: 30.7+ KB

In [5]:
movies.describe()

             Rank         Year
count  782.000000   782.000000
mean   391.500000  2006.620205
std    225.888247    10.026227
min      1.000000  1939.000000
25%    196.250000  2001.000000
50%    391.500000  2009.000000
75%    586.750000  2014.000000
max    782.000000  2019.000000

In [6]:
# Transpose the dataset with .T: swaps the columns and rows in the output
# Examine the statistical summary of the dataset
movies.describe().T

      count         mean         std     min      25%     50%      75%     max
Rank  782.0   391.500000  225.888247     1.0   196.25   391.5   586.75   782.0
Year  782.0  2006.620205   10.026227  1939.0  2001.00  2009.0  2014.00  2019.0

In [7]:
# Get the summary of the object dtype variables
movies.describe(include='object')

                       Title           Studio     Gross
count                    782              782       782
unique                   773               37       701
top     Beauty and the Beast  Warner Brothers  $225.90
freq                       2              132         3

**Observations:**
- can only get one or the other when using describe (basic or object)
- using .T (transcribe) you can view the dataset set on a different axis to better understand the data
- (std) Standard Deviation is a measure of how spread out the numbers are in the datset
- when the mean and median are close, the dataset is well balanced
- describe also returns the MINimum, MAXimum, and percentile within the dataset

#### Data Mining Questions:

In [8]:
# Q 1: how many studios are there in this dataset, and what are they?
movies['Studio'].value_counts()

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Polygram                    2
Orion                       2
SonR                        2
Dimension                   2
Vestron                     1
USA                         1
Lions                       1
Focus                       1
Rela.                       1
CL                          1
Pathe                       1
Artisan                     1
IFC                         1
GrtIndia                    1
RKO                         1
UTV                         1
FUN                         1
FR                          1
Newmarket                   1
China Film Corporation      1
HC                          1
Magn.                       1
Name: count, dtype: int64

In [9]:
movies['Studio'].value_counts().head(10)

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: count, dtype: int64

**Observations:**
- using square brackets [] returns a Series of that single column
- using .value_counts() and then .head() returns the counts of each studio and the first 10 rows

In [10]:
# Q 2. show only movies released by FOX studio
movies[movies['Studio'] == 'Fox'].head()

    Rank                                      Title Studio       Gross  Year
1      2                                     Avatar    Fox  $2,789.70   2009
34    35  Star Wars: Episode I - The Phantom Menace    Fox  $1,027.00   1999
53    54                          Bohemian Rhapsody    Fox    $903.70   2018
56    57             Ice Age: Dawn of the Dinosaurs    Fox    $886.70   2009
61    62                 Ice Age: Continental Drift    Fox    $877.20   2012

**Observations:**
- you can filter the datset by setting a conditional argument that evaluates to a specific condition
- this expression returns a Boolean (True or False) result depending on if that condition has been met or not

In [11]:
# storing the movies of Fox Studio in a variable
movies_released_Fox = movies[movies['Studio'] == 'Fox']

In [12]:
# Q 3. see the movies released only in 2015
movies_released_2015 = movies[movies['Year'] == 2015]

In [13]:
# see the number of movies released in 2015
len(movies_released_2015)

39

**Observations:**
- you can filter through strings or numbers
- you can set a variable for a Series and then use the varable in multiple methods to find different inforamtion

In [14]:
# Q 4. how many movies were released i 2015
movies_released_Fox_2015 = movies[(movies['Year'] == 2015) & (movies['Studio'] == 'Fox')]
movies_released_Fox_2015

     Rank                                   Title Studio     Gross  Year
136   137                             The Martian    Fox  $630.20   2015
185   186                            The Revenant    Fox  $533.00   2015
274   275            Kingsman: The Secret Service    Fox  $414.40   2015
301   302                                    Home    Fox  $386.00   2015
415   416                                 Taken 3    Fox  $326.50   2015
437   438          Maze Runner: The Scorch Trials    Fox  $312.30   2015
594   595                       The Peanuts Movie    Fox  $246.20   2015
636   637                                     Spy    Fox  $235.70   2015
640   641  Alvin and the Chipmunks: The Road Chip    Fox  $234.80   2015

In [15]:
len(movies_released_Fox_2015)

9

In [16]:
oren_code = movies_released_Fox[movies_released_Fox['Year'] == 2015]
oren_code

     Rank                                   Title Studio     Gross  Year
136   137                             The Martian    Fox  $630.20   2015
185   186                            The Revenant    Fox  $533.00   2015
274   275            Kingsman: The Secret Service    Fox  $414.40   2015
301   302                                    Home    Fox  $386.00   2015
415   416                                 Taken 3    Fox  $326.50   2015
437   438          Maze Runner: The Scorch Trials    Fox  $312.30   2015
594   595                       The Peanuts Movie    Fox  $246.20   2015
636   637                                     Spy    Fox  $235.70   2015
640   641  Alvin and the Chipmunks: The Road Chip    Fox  $234.80   2015

**Observations:**
- there are multiple ways to filter data
- you can again use conditional filtering with 2 equal signs (==)
- you can also use logical conditions with and (&) or or(|)

### Conclusion:
- you can extract a Series by specifying a column using square brackets []
allowing column specif operations
- conditional filtering can be used with pandas to isolate rows where a specific condition is needed
- logical operators (AND(&)) and (OR(|)) can be used to combine muliple conditions and parenthesis are crucial for correct operation
- value_counts() methos can be used to generate a frequency count on specific columns
- head() and tail() give a preview to the dataset without printing the entire dataset
- describe() generates a summary of numerical columns by default, but can be used for objects 
- you can create new Series and DataFrames by assigning variables to the filtered conditions 
- multi-conditional filtering can be used to focus on subsets of data
- you can chain multiple methods together in one line performing more than one step
- performing EDA has many steps, but is necessary to understand the dataset

##### End of Lab 06